{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "CharDelimiterSplit",
    "delimiter": " "
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[MASK]": 2,
      ")": 3,
      "(": 4,
      "c_6": 5,
      "C_alkyl": 6,
      "1": 7,
      "2": 8,
      "=": 9,
      "c_5": 10,
      "C_6": 11,
      "N_secondary_amine": 12,
      "O_ketone": 13,
      "c_5-6": 14,
      "1\n": 15,
      "3": 16,
      "C_ketone": 17,
      "C_5": 18,
      "n_5": 19,
      "O_amide": 20,
      "C_amide": 21,
      "c_6-6": 22,
      "C_tertiary_carbon": 23,
      "O_ether": 24,
      "C_tertiary_carbon_5": 25,
      "C_5-6": 26,
      "n_6": 27,
      "C_tertiary_carbon_6": 28,
      "O_sulfonyl": 29,
      "n_tertiary_amine_5": 30,
      "O_ester": 31,
      "C_4": 32,
      "C_ester": 33,
      "C_3": 34,
      "F_fluoro": 35,
      "C_5-5": 36,
      "N_tertiary_amine_6": 37,
      "O_hydroxyl": 38,
      "N_amide_6": 39,
      "C_6-6": 40,
      "4": 41,
      "F_trifluoromethyl": 42,
      "-": 43,
      "o_5": 44,
      "n_5-6": 45,
      "C_7": 46,
      "N_amide": 47,
      "N_amide_5": 48,
      "S_sulfonyl": 49,
      "C_tertiary_carbon_3": 50,
      "n_secondary_amine_5": 51,
      "Cl_chloro": 52,
      "s_5": 53,
      "C_alkene": 54,
      "C_alkyl\n": 55,
      "C_tertiary_carbon_5-6": 56,
      "N_tertiary_amine": 57,
      "C_tertiary_carbon_4": 58,
      "O_carboxyl": 59,
      "C_alkyne": 60,
      "O_ether_6": 61,
      "C_quaternary_carbon": 62,
      "2\n": 63,
      "N_primary_amine": 64,
      "C_tertiary_carbon_5-5": 65,
      "N_tertiary_amine_5": 66,
      "O_nitro": 67,
      "C_4-5": 68,
      "C_4-6": 69,
      "N_amide_5-6": 70,
      "n_tertiary_amine_5-6": 71,
      "C_trifluoromethyl": 72,
      "/": 73,
      "N_nitrile": 74,
      "C_carboxyl": 75,
      "#": 76,
      "S_sulfide": 77,
      "O_ether_5": 78,
      "F_difluoromethyl": 79,
      "Br_bromo": 80,
      "C_tertiary_carbon_6-6": 81,
      "N_nitro": 82,
      "C_quaternary_carbon_6": 83,
      "c_5-5": 84,
      "O_ether_5-6": 85,
      "C_6-7": 86,
      "C_quaternary_carbon_5": 87,
      "n_6-6": 88,
      "C_3-5": 89,
      "N_amide_4": 90,
      "c_6-7": 91,
      "C_quaternary_carbon_4": 92,
      "C_tertiary_carbon_3-5": 93,
      "N_amide_5-5": 94,
      "O_ether_6-6": 95,
      "C_quaternary_carbon_3": 96,
      "n_secondary_amine_5-6": 97,
      "C_amide_5": 98,
      "N_amide_6-6": 99,
      "C_ketone_5": 100,
      "c_6-5-6": 101,
      "c_5-6-6": 102,
      "C_difluoromethyl": 103,
      "C_5-7": 104,
      "C_alkene_carbon": 105,
      "F_fluoro\n": 106,
      "C_6-6-6": 107,
      "N_tertiary_amine_5-6": 108,
      "N_secondary_amine_5": 109,
      "N_amide_4-5": 110,
      "c_6-6-6": 111,
      "O_amide\n": 112,
      "s_5-6": 113,
      "N_secondary_amine_6": 114,
      "N_amide_7": 115,
      "O_hydroxyl\n": 116,
      "O_ketone\n": 117,
      "N_tertiary_amine_5-5": 118,
      "C_tertiary_carbon_4-6": 119,
      "C_tertiary_carbon_7": 120,
      "N_amide_4-6": 121,
      "C_3-6": 122,
      "C_quaternary_carbon_5-5": 123,
      "\\": 124,
      "o_5-6": 125,
      "Cl_chloro\n": 126,
      "C_quaternary_carbon_5-6": 127,
      "N_tertiary_amine_7": 128,
      "N_tertiary_amine_4": 129,
      "5": 130,
      "C_ketone_6": 131,
      "n_amide_6": 132,
      "c_amide_6": 133,
      "C_quaternary_carbon_4-5": 134,
      "N_secondary_ketimine": 135,
      "O_O": 136,
      "N_imide_5": 137,
      "C_4-4": 138,
      "C_amide_6": 139,
      "C_ketone_5-6": 140,
      "C_ester_5": 141,
      "n_5-5": 142,
      "C_tertiary_carbon_6-6-6": 143,
      "O_ether_6-7": 144,
      "N_tertiary_amine_6-6": 145,
      "F_trifluoromethyl\n": 146,
      "C_quaternary_carbon_6-6": 147,
      "O_imide": 148,
      "O_carboxyl\n": 149,
      "C_tertiary_carbon_3-5-5": 150,
      "n_amide_5-6": 151,
      "C_6-6-6-6": 152,
      "N_amide_6-7": 153,
      "n_secondary_amine_6": 154,
      "C_8": 155,
      "C_6-5-6": 156,
      "C_tertiary_carbon_5-5-5": 157,
      "n_tertiary_amine_5-5": 158,
      "c_5-5-6": 159,
      "S_sulfide_5": 160,
      "O_carbamate": 161,
      "c_ketone_6": 162,
      "S_sulfonyl_5": 163,
      "N_secondary_amine_5-6": 164,
      "N_secondary_amine_6-6": 165,
      "c_amide_5-6": 166,
      "O_ether_5-5": 167,
      "S_sulfide_6": 168,
      "O_nitro\n": 169,
      "C_5-5-5": 170,
      "C_ketone_6-6": 171,
      "c_5-7": 172,
      "C_3-4": 173,
      "O_sulfonyl\n": 174,
      "n_amide_5": 175,
      "C_tertiary_carbon_4-5-5": 176,
      "C_quaternary_carbon_4-6": 177,
      "S_thioketone": 178,
      "C_5-5-6": 179,
      "c_amide_6-6": 180,
      "n_amide_6-6": 181,
      "Br_bromo\n": 182,
      "C_5-6-6-6": 183,
      "C_5-6-6": 184,
      "C_tertiary_carbon_3-6": 185,
      "C_tertiary_carbon_4-5": 186,
      "O_ester_5": 187,
      "O_sulfinyl": 188,
      "N_tertiary_amine_4-6": 189,
      "C_secondary_aldimine": 190,
      "N_secondary_aldimine": 191,
      "C_4-5-5": 192,
      "C_tertiary_carbon_5-7": 193,
      "N_imide_5-6": 194,
      "C_secondary_ketimine_5": 195,
      "C_quaternary_carbon_3-5": 196,
      "c_amide_5": 197,
      "F_difluoromethyl\n": 198,
      "O_sulfonate_ester": 199,
      "c_ketone_6-6": 200,
      "C_tertiary_carbon_4-4": 201,
      "O_ether_7": 202,
      "S_sulfinyl": 203,
      "C_thioketone": 204,
      "N_nitrile\n": 205,
      "s_5-5": 206,
      "N_amide_3-5": 207,
      "C_secondary_ketimine": 208,
      "N_secondary_ketimine_5": 209,
      "C_tertiary_carbon_6-6-6-6": 210,
      "C_3-5-5": 211,
      "S_sulfonyl_6": 212,
      "C_amide_5-6": 213,
      "c_secondary_ketimine_6": 214,
      "C_imide_5": 215,
      "C_carbamate": 216,
      "N_carbamate": 217,
      "N_tertiary_amine_3-5": 218,
      "C_tertiary_carbon_5-6-6-6": 219,
      "n_5-7": 220,
      "c_ester_6": 221,
      "C_quaternary_carbon_6-7": 222,
      "c_4-6": 223,
      "N_amide_5-7": 224,
      "C_3-3": 225,
      "O_ether_3-5": 226,
      "N_amide_6-6-6": 227,
      "C_quaternary_carbon_4-4": 228,
      "O_ether_4-6": 229,
      "N_primary_amine\n": 230,
      "C_quaternary_carbon_3-6": 231,
      "n_5-6-6": 232,
      "c_ketone_5-6": 233,
      "I_iodo": 234,
      "N_primary_ketimine": 235,
      "c_5-6-5": 236,
      "n_secondary_amine_6-6": 237,
      "c_6-6-6-6": 238,
      "C_amide_6-6": 239,
      "O_ether_4-5": 240,
      "N_secondary_amine_7": 241,
      "c_6-6-5-6": 242,
      "S_sulfhydryl": 243,
      "c_6-7-6": 244,
      "C_ketone_5-5": 245,
      "n_secondary_amine_5-5": 246,
      "c_6-6-7": 247,
      "c_secondary_ketimine_5": 248,
      "c_3-5-6": 249,
      "n_imide_6": 250,
      "n_6-5-6": 251,
      "o_6-6": 252,
      "N_tertiary_amine_6-6-6": 253,
      "C_5-6-5": 254,
      "c_5-6-6-6": 255,
      ".": 256,
      "N_tertiary_amine_4-5": 257,
      "C_aldehyde": 258,
      "C_quaternary_carbon_7": 259,
      "C_ester_6": 260,
      "c_6-5-6-6": 261,
      "C_tertiary_carbon_3-4": 262,
      "C_ester_5-6": 263,
      "C_10": 264,
      "S_sulfonyl_5-6": 265,
      "C_ketone_7": 266,
      "N_secondary_amine_5-5": 267,
      "C_tertiary_carbon_6-7": 268,
      "C_ester\n": 269,
      "n_imide_5-6": 270,
      "N_tertiary_amine_5-7": 271,
      "3\n": 272,
      "c_6-5-7": 273,
      "O_aldehyde": 274,
      "O_5": 275,
      "c_3-6-6": 276,
      "C_4-7": 277,
      "C_quaternary_carbon_3-4": 278,
      "S_S": 279,
      "O_ether_4": 280,
      "n_tertiary_amine_5-7": 281,
      "C_primary_ketimine": 282,
      "C_4-4-4": 283,
      "S_sulfide_6-6": 284,
      "O_O[-1]": 285,
      "C_quaternary_carbon_6-6-6-6": 286,
      "C_secondary_ketimine_5-6": 287,
      "C_ketone_5-5-5": 288,
      "c_3-6-5": 289,
      "S_sulfonate_ester": 290,
      "C_imide_5-6": 291,
      "C_tertiary_carbon_4-5-5-5-5": 292,
      "C_secondary_ketimine_6": 293,
      "N_tertiary_amine_6-7": 294,
      "n_imide_6-6": 295,
      "N_secondary_amine_6-7": 296,
      "n_tertiary_amine_6": 297,
      "N_imide_5-5": 298,
      "c_5-6-5-6": 299,
      "O_ether_3-5-5": 300,
      "O_acetal": 301,
      "C_amide_7": 302,
      "N_secondary_ketimine_5-6": 303,
      "C_tertiary_carbon_5-5-6": 304,
      "S_sulfide_5-6": 305,
      "C_ketone_6-7": 306,
      "n_tertiary_amine_5-6-6": 307,
      "6": 308,
      "N_secondary_ketimine_6": 309,
      "C_quaternary_carbon_5-5-6": 310,
      "c_5-6-7": 311,
      "o_6": 312,
      "C_6-5-7": 313,
      "C_tertiary_carbon_5-6-6": 314,
      "C_6-7-7": 315,
      "C_quaternary_carbon_6-6-6": 316,
      "C_ester_6-6": 317,
      "N_amide_4-5-5": 318,
      "C_quaternary_carbon_3-3": 319,
      "C_tertiary_carbon_3-3": 320,
      "N_amide_5-5-6": 321,
      "N_imide_6": 322,
      "N_amide_3-6": 323,
      "N_tertiary_amine_4-5-5": 324,
      "C_quaternary_carbon_4-4-4": 325,
      "c_thioketone_5": 326,
      "O_ether_5-5-5": 327,
      "C_tertiary_carbon_8": 328,
      "c_imide_6": 329,
      "C_tertiary_carbon_3-5-6": 330,
      "C_3-6-6": 331,
      "N_N": 332,
      "c_5-7-6": 333,
      "C_tertiary_carbon_6-5-6": 334,
      "n_secondary_amine_6-5-6": 335,
      "N_imide_5-5-5": 336,
      "C_ester_5-5": 337,
      "O_ester_5-6": 338,
      "O_ether_5-6-6": 339,
      "n_5-5-6": 340,
      "C_5-4-5": 341,
      "C_tertiary_carbon_3-6-5": 342,
      "N_secondary_amine_4": 343,
      "O_ester\n": 344,
      "o_5-5": 345,
      "S_sulfonyl_6-6": 346,
      "C_6-6-6-6-6": 347,
      "C_5-8": 348,
      "c_6-8": 349,
      "N_amide_5-6-6": 350,
      "O_ether_5-5-6": 351,
      "c_6-6-6-6-6": 352,
      "C_6-6-7": 353,
      "S_sulfinyl_6": 354,
      "n_tertiary_amine_6-5-6": 355,
      "n_6-6-6": 356,
      "C_5-6-7": 357,
      "C_6-6-5-6": 358,
      "s_6-5-6": 359,
      "c_secondary_ketimine_5-6": 360,
      "N_amide_6-5-6": 361,
      "n_amide_5-6-6": 362,
      "C_quaternary_carbon_5-6-6-6": 363,
      "O_ether_6-6-6": 364,
      "N_tertiary_amine_3-6": 365,
      "C_acetal": 366,
      "N_amide_5-5-5": 367,
      "n_5-6-5": 368,
      "n_tertiary_amine_6-6": 369,
      "C_quaternary_carbon_6-5-6": 370,
      "C_ketone_6-6-6": 371,
      "C_quaternary_carbon_5-6-6": 372,
      "C_3-7": 373,
      "c_amide_5-6-6": 374,
      "c_5-6-6-6-6": 375,
      "N_amide_5-6-6-6": 376,
      "N_amide_8": 377,
      "C_4-4-5": 378,
      "I_iodo\n": 379,
      "C_ketone_4": 380,
      "O_ether_3-6": 381,
      "c_secondary_ketimine_6-6": 382,
      "C_6-8": 383,
      "n_amide_6-5-6": 384,
      "S_sulfide_5-5": 385,
      "S_sulfide_7": 386,
      "c_amide_6-5-6": 387,
      "S_thioketone\n": 388,
      "c_imide_5-6": 389,
      "S_sulfonyl_7": 390,
      "C_3-5-6": 391,
      "O_carbonate_ester": 392,
      "O_ether_6-5-6": 393,
      "C_trimethylsilyl": 394,
      "N_tertiary_amine_6-5-6": 395,
      "C_secondary_ketimine_6-6": 396,
      "C_amide_6-7": 397,
      "O_ester_6-6": 398,
      "S_sulfonyl_4": 399,
      "N_secondary_amine_5-7": 400,
      "C_5-6-6-6-6": 401,
      "N_azo": 402,
      "N_amide_4-4": 403,
      "c_6-7-7": 404,
      "c_imide_6-6": 405,
      "C_4-6-6": 406,
      "N_tertiary_amine_5-5-6": 407,
      "n_tertiary_amine_5-5-6": 408,
      "c_5-4-6": 409,
      "O_phosphodiester": 410,
      "C_imide_5-5": 411,
      "C_6-7-6": 412,
      "N_ketoxime": 413,
      "C_9": 414,
      "O_ester_5-5": 415,
      "Cl_trichloromethyl": 416,
      "c_6-6-5-6-6": 417,
      "O_phosphono": 418,
      "c_5-6-6-5": 419,
      "C_5-7-6": 420,
      "C_tertiary_carbon_3-6-6": 421,
      "o_5-6-6": 422,
      "N_tertiary_amine_5-6-6-6": 423,
      "N_tertiary_amine_5-6-6": 424,
      "C_tertiary_carbon_6-7-7": 425,
      "C_amide_5-5": 426,
      "O_sulfonic_acid": 427,
      "c_ester_6-6": 428,
      "C_thioketone_6": 429,
      "s_5-6-6": 430,
      "c_primary_ketimine_6": 431,
      "N_amide_10": 432,
      "C_imide_6": 433,
      "C_amide_5-6-6": 434,
      "C_ketone_5-6-6": 435,
      "C_quaternary_carbon_5-7": 436,
      "c_5-6-6-6-6-6": 437,
      "N_secondary_ketimine_6-6": 438,
      "C_tertiary_carbon_6-6-6-6-6": 439,
      "C_quaternary_carbon_4-5-5": 440,
      "c_6-5-6-6-6": 441,
      "o_6-5-6": 442,
      "C_tertiary_carbon_5-4-5": 443,
      "C_amide_4": 444,
      "s_5-5-6": 445,
      "c_ketone_6-6-6": 446,
      "C_ketoxime": 447,
      "C_6-5-6-6": 448,
      "C_3-8": 449,
      "C_quaternary_carbon_6-6-6-6-6": 450,
      "C_tertiary_carbon_5-6-5": 451,
      "C_3-6-5": 452,
      "C_ester_4": 453,
      "C_tertiary_carbon_4-4-5": 454,
      "n_6-7": 455,
      "c_6-5-5-6": 456,
      "s_5-7": 457,
      "O_O\n": 458,
      "c_4-6-6": 459,
      "O_ketoxime": 460,
      "c_5-8": 461,
      "O_sulfinyl\n": 462,
      "C_quaternary_carbon_5-5-5": 463,
      "C_ketone_5-5-6": 464,
      "C_quaternary_carbon_5-6-5": 465,
      "O_carboxylate": 466,
      "n_amide_6-6-6": 467,
      "c_amide_6-6-6": 468,
      "C_4-5-5-5-5": 469,
      "C_5-6-5-6": 470,
      "P_P": 471,
      "C_ketone_5-7": 472,
      "N_secondary_amine_3-5": 473,
      "c_5-5-6-6": 474,
      "c_6-6-6-5-6": 475,
      "C_5-4-6": 476,
      "C_ketone_10": 477,
      "N_secondary_amine_10": 478,
      "O_ether_5-6-5": 479,
      "O_phosphate": 480,
      "n_tertiary_amine_5-6-5": 481,
      "N_tertiary_amine_5-5-5": 482,
      "c_6-4-6": 483,
      "C_7-7": 484,
      "N_secondary_amine_6-6-6": 485,
      "n_secondary_amine_5-6-6": 486,
      "S_sulfinyl_7": 487,
      "C_tertiary_carbon_5-5-6-5": 488,
      "c_5-5-5-6": 489,
      "n_5-6-5-6": 490,
      "C_tertiary_carbon_3-7": 491,
      "n_6-5-6-6": 492,
      "c_5-6-5-6-6": 493,
      "N_secondary_amine_5-6-6": 494,
      "F_difluorochloromethyl": 495,
      "C_primary_ketimine_5": 496,
      "C_3-5-4": 497,
      "c_ketone_6-5-6": 498,
      "C_quaternary_carbon_4-7": 499,
      "7": 500,
      "O_aldehyde\n": 501,
      "C_imide": 502,
      "N_amide_5-6-5": 503,
      "O_ether_5-7": 504,
      "c_4-5-5": 505,
      "C_secondary_ketimine_5-5": 506,
      "C_tertiary_carbon_5-6-6-6-6": 507,
      "N_secondary_amine_5-5-6": 508,
      "C_ketone_6-5-6": 509,
      "S_S\n": 510,
      "c_ketone_5-6-6": 511,
      "c_ester_5-6": 512,
      "C_tertiary_carbon_4-4-4": 513,
      "C_12": 514,
      "C_tertiary_carbon_6-6-5-6": 515,
      "N_tertiary_amine_10": 516,
      "o_6-6-6": 517,
      "O_ester_6": 518,
      "C_secondary_ketimine_5-6-6": 519,
      "c_5-4-5": 520,
      "O_5-6": 521,
      "s_5-6-5": 522,
      "N_tertiary_amine_6-7-7": 523,
      "n_imide_6-5-6": 524,
      "S_sulfide_6-7": 525,
      "C_6-14": 526,
      "N_secondary_ketimine_5-6-6": 527,
      "C_quaternary_carbon_3-6-6": 528,
      "N_secondary_amine_4-5": 529,
      "C_ketone_5-6-6-6": 530,
      "N_secondary_amine_4-6": 531,
      "C_6-4-6": 532,
      "c_6-14": 533,
      "n_secondary_amine_5-7": 534,
      "N_secondary_ketimine_5-5": 535,
      "n_secondary_amine_6-6-6": 536,
      "N_secondary_amine_6-5-6": 537,
      "C_amide_5-5-6": 538,
      "C_thioketone_5": 539,
      "N_secondary_amine_3-6": 540,
      "c_primary_ketimine_5": 541,
      "c_5-7-5": 542,
      "C_tertiary_carbon_3-8": 543,
      "S_sulfide_3-5": 544,
      "C_quaternary_carbon_5-6-6-6-6": 545,
      "C_carboxylate": 546,
      "N_secondary_aldimine_6": 547,
      "4\n": 548,
      "C_secondary_aldimine_6": 549,
      "n_amide_5-7": 550,
      "o_5-7": 551,
      "c_6-6-5-5-6": 552,
      "C_ketone_3-5": 553,
      "C_tertiary_carbon_5-7-6": 554,
      "c_5-16-5-5-5": 555,
      "C_quaternary_carbon_5-4-5": 556,
      "C_secondary_ketimine_6-7": 557,
      "N_azide": 558,
      "n_tertiary_amine_6-6-6": 559,
      "c_ketone_5": 560,
      "C_tertiary_carbon_5-6-6-6-6-6": 561,
      "C_4-5-5-6": 562,
      "N_N[1]": 563,
      "Si_trimethylsilyl": 564,
      "n_amide_5-5-6": 565,
      "S_sulfonyl_5-5": 566,
      "C_carbonate_ester": 567,
      "C_5-5-6-6-6": 568,
      "*": 569,
      "C_ketone_6-6-6-6": 570,
      "C_trichloromethyl": 571,
      "C_quaternary_carbon_6-6-5-6": 572,
      "F_bromodifluoromethyl": 573,
      "c_amide_5-5-6": 574,
      "P_phosphono": 575,
      "O_5-5": 576,
      "S_sulfide_4": 577,
      "c_6-16-6-6-6": 578,
      "n_imide_5-5-6": 579,
      "C_5-6-6-6-6-6": 580,
      "N_secondary_ketimine_6-7": 581,
      "C_tertiary_carbon_4-6-6": 582,
      "N_amide_4-7": 583,
      "c_5-6-6-5-6": 584,
      "C_tertiary_carbon_3-4-4": 585,
      "c_6-5-5-6-6": 586,
      "C_tertiary_carbon_5-5-5-6": 587,
      "N_tertiary_amine_4-4": 588,
      "C_tertiary_carbon_15": 589,
      "C_11": 590,
      "n_amide_5-6-5": 591,
      "n_5-6-6-6": 592,
      "n_6-6-5-6": 593,
      "S_sulfonic_acid": 594,
      "c_6-18-6-6": 595,
      "S_carbodithio": 596,
      "N_4_ammonium_ion": 597,
      "C_14": 598,
      "C_tertiary_carbon_5-5-6-6": 599,
      "O_ether_3": 600,
      "C_quaternary_carbon_3-5-6": 601,
      "C_amide_5-7": 602,
      "c_6-16-6-6": 603,
      "N_amide_6-7-7": 604,
      "c_5-17-6-17-6": 605,
      "C_6-6-7-7": 606,
      "c_ketone_5-5-6": 607,
      "C_5-7-5": 608,
      "N_tertiary_amine_8": 609,
      "C_tertiary_carbon_3-6-6-5-6": 610,
      "N_imide_5-5-6": 611,
      "n_6-6-7": 612,
      "C_ketone_4-5": 613,
      "C_imide_5-5-5": 614,
      "C_difluorochloromethyl": 615,
      "N_tertiary_amine_6-6-6-6": 616,
      "C_6-5-6-6-6": 617,
      "N_secondary_amine_5-6-6-6": 618,
      "C_ester_4-5": 619,
      "c_5-7-5-6": 620,
      "C_4-8": 621,
      "C_5-14": 622,
      "N_tertiary_amine_5-6-5": 623,
      "P_phosphodiester": 624,
      "C_ketone_4-6": 625,
      "C_tertiary_carbon_7-7": 626,
      "C_tertiary_carbon_5-6-7": 627,
      "C_amide_6-5-6": 628,
      "n_6-7-6": 629,
      "C_secondary_ketimine_7": 630,
      "c_amide_5-6-5": 631,
      "C_ester_3-5": 632,
      "O_6": 633,
      "N_amide_6-6-7": 634,
      "C_6-5-5-6": 635,
      "O_ether_4-4-5": 636,
      "C_amide_6-6-6": 637,
      "N_amide_6-5-7": 638,
      "%": 639,
      "O_ether_4-7": 640,
      "C_quaternary_carbon_4-4-5": 641,
      "c_6-6-6-6-6-6": 642,
      "Br_Br[-1]": 643,
      "C_tertiary_carbon_5-6-5-6": 644,
      "C_ester_5-5-5": 645,
      "N_tertiary_amine_6-5-7": 646,
      "C_5-5-6-6": 647,
      "n_5-6-7": 648,
      "C_tertiary_carbon_6-7-6": 649,
      "S_5": 650,
      "Cl_difluorochloromethyl": 651,
      "C_6-6-14": 652,
      "n_6-5-7": 653,
      "C_amide_8": 654,
      "C_15": 655,
      "c_5-3-6": 656,
      "N_amide_6-7-6": 657,
      "Na_Na[1]": 658,
      "O_O[-1]\n": 659,
      "N_imide_5-6-6": 660,
      "n_tertiary_amine_6-5-7": 661,
      "C_6-19": 662,
      "c_5-5-6-6-6": 663,
      "C_6-6-6-5-6": 664,
      "C_secondary_ketimine_6-5-6": 665,
      "N_secondary_amine_6-7-6": 666,
      "C_ester_5-6-6-6": 667,
      "c_4": 668,
      "O_ether_5-4-5": 669,
      "C_quaternary_carbon_4-6-6": 670,
      "C_tertiary_carbon_14": 671,
      "C_tertiary_carbon_4-4-5-5-5-5": 672,
      "C_primary_ketimine_5-6": 673,
      "C_tertiary_carbon_6-5-7": 674,
      "C_tertiary_carbon_20": 675,
      "N_secondary_aldimine_5": 676,
      "C_secondary_aldimine_5": 677,
      "C_ester_5-6-6": 678,
      "N_tertiary_amine_4-7": 679,
      "C_tertiary_carbon_5-14": 680,
      "C_16": 681,
      "N_tertiary_amine_5-6-7": 682,
      "C_4-5-6-5": 683,
      "C_thiolester": 684,
      "c_6-19-6-19-6": 685,
      "n_tertiary_amine_5-6-5-6": 686,
      "S_sulfonyl_5-6-6": 687,
      "O_thiolester": 688,
      "C_quaternary_carbon_3-5-4": 689,
      "c_5-7-6-6": 690,
      "c_6-20-6-6-6-20": 691,
      "C_18": 692,
      "S_sulfide_6-6-6": 693,
      "c_ketone_4": 694,
      "C_tertiary_carbon_3-5-4": 695,
      "O_ether_6-7-6": 696,
      "O_ketoxime\n": 697,
      "c_6-5-5-7": 698,
      "c_6-6-14": 699,
      "N_amidine": 700,
      "n_6-6-6-6": 701,
      "8": 702,
      "C_tertiary_carbon_5-5-6-6-6": 703,
      "S_sulfide_5-5-6": 704,
      "C_6-13": 705,
      "S_disulfide": 706,
      "c_7": 707,
      "S_sulfide_5-7": 708,
      "c_thioketone_6-6": 709,
      "N_secondary_amine_4-5-5": 710,
      "N_secondary_amine_20": 711,
      "9": 712,
      "C_ketone_20": 713,
      "c_6-5-6-7": 714,
      "N_secondary_ketimine_6-5-6": 715,
      "O_ether_5-6-6-6": 716,
      "n_5-8": 717,
      "c_thioketone_5-6": 718,
      "c_amide_5-7": 719,
      "c_6-5-6-5-6": 720,
      "C_6-11": 721,
      "C_tertiary_carbon_5-5-5-5": 722,
      "N_primary_ketimine\n": 723,
      "C_5-6-17": 724,
      "s_5-8": 725,
      "c_primary_ketimine_5-6": 726,
      "C_ester_6-6-6": 727,
      "N_amide_6-6-5-6": 728,
      "c_6-17-6-17-6": 729,
      "C_amide_5-5-5": 730,
      "C_ketone_6-6-5-6": 731,
      "C_amide_4-5": 732,
      "C_5-18": 733,
      "C_5-5-5-6": 734,
      "Na_Na[1]\n": 735,
      "C_tertiary_carbon_3-4-3": 736,
      "S_6": 737,
      "N_imide_6-6-6": 738,
      "n_amide_5-5": 739,
      "C_5-5-6-5": 740,
      "C_quaternary_carbon_5-6-6-6-6-6": 741,
      "N_tertiary_amine_3": 742,
      "C_ketone_6-7-6": 743,
      "C_alkyne\n": 744,
      "O_ether_6-6-7": 745,
      "C_6-5-5-6-6-6": 746,
      "S_sulfonyl_6-7": 747,
      "N_amide_3-4": 748,
      "n_secondary_amine_5-5-6": 749,
      "C_alkene\n": 750,
      "C_tertiary_carbon_6-5-6-6": 751,
      "C_tertiary_carbon_6-6-7-6-7": 752,
      "C_6-18-6-6": 753,
      "O_ether_4-5-5": 754,
      "n_tertiary_amine_4-5-5": 755,
      "n_4-5-5": 756,
      "O_6-6": 757,
      "C_bromodifluoromethyl": 758,
      "P_phosphate": 759,
      "C_ketone_5-5-5-6": 760,
      "N_amide_5-6-7": 761,
      "C_quaternary_carbon_5-4-6": 762,
      "c_5-5-5-5-6": 763,
      "S_sulfonyl_3-6": 764,
      "c_amide_5-5": 765,
      "C_tertiary_carbon_18": 766,
      "C_6-5-5-6-6": 767,
      "c_5-5-7": 768,
      "C_tertiary_carbon_3-4-5": 769,
      "c_6-6-18-6-18-6": 770,
      "s_5-6-5-6": 771,
      "O_6-6-6": 772,
      "N_3": 773,
      "c_6-12-16-16-6-6-6-16-6-16": 774,
      "C_5-16": 775,
      "c_6-6-6-7": 776,
      "S_sulfonyl_4-4": 777,
      "C_6-16-6-6": 778,
      "C_5-6-5-6-6": 779,
      "C_5-6-6-5": 780,
      "c_5-20-6-6-6-20": 781,
      "O_ether_6-8": 782,
      "S_sulfinyl_5": 783,
      "N_secondary_amine_18": 784,
      "C_carbodithio": 785,
      "C_6-12": 786,
      "N_5-6": 787,
      "C_ketone_18": 788,
      "I_I[-1]\n": 789,
      "O_ether_6-6-6-6": 790,
      "C_quaternary_carbon_6-5-6-6": 791,
      "c_imide_6-5-6": 792,
      "C_6-15": 793,
      "S_S[1]": 794,
      "C_tertiary_carbon_23": 795,
      "N_aldoxime": 796,
      "n_secondary_amine_5-6-5": 797,
      "c_5-6-18": 798,
      "n_5-4-5": 799,
      "n_tertiary_amine_5-4-5": 800,
      "c_6-18-6-6-6-18": 801,
      "c_5-6-6-6-6-6-6": 802,
      "n_tertiary_amine_5-6-6-6": 803,
      "N_amide_3-6-6": 804,
      "C_tertiary_carbon_6-6-7": 805,
      "C_ketone_3-5-6": 806,
      "C_aldoxime": 807,
      "C_3-4-4": 808,
      "N_secondary_amine_3-5-6": 809,
      "N_imide_5-7": 810,
      "N_imide_6-6": 811,
      "C_tertiary_carbon_6-6-7-7": 812,
      "C_amide_4-6": 813,
      "C_ketone_23": 814,
      "N_secondary_amine_23": 815,
      "S_sulfonyl_6-6-6": 816,
      "O_nitrate": 817,
      "c_5-6-17": 818,
      "n_tertiary_amine_6-6-5-6": 819,
      "c_6-9-5-6": 820,
      "C_3-6-6-5-6": 821,
      "C_amide_6-6-5-6": 822,
      "c_5-17-6": 823,
      "C_tertiary_carbon_5-5-49-47-47": 824,
      "C_5-6-6-5-6": 825,
      "n_secondary_amine_6-6-5-6": 826,
      "c_6-6-8": 827,
      "N_secondary_amine_5-5-5": 828,
      "C_6-6-7-6-7": 829,
      "C_5-6-6-6-6-6-6": 830,
      "N_secondary_amine_15": 831,
      "N_ester": 832,
      "C_tertiary_carbon_5-50-37-58": 833,
      "N_secondary_amine_3": 834,
      "S_thiolester": 835,
      "C_6-18": 836,
      "N_6": 837,
      "C_tertiary_carbon_6-5-5-6-6-6": 838,
      "O_ether_3-4": 839,
      "C_ketone_15": 840,
      "C_5-5-5-5": 841,
      "C_4-5-6": 842,
      "N_amide_6-8": 843,
      "N_amide_5-4-6": 844,
      "n_5-7-6": 845,
      "C_ketone_5-50-37-58": 846,
      "N_secondary_amine_5-50-37-58": 847,
      "c_thioketone_6": 848,
      "n_tertiary_amine_6-5-6-6": 849,
      "C_5-14-6": 850,
      "C_ketone_5-5-49-47-47": 851,
      "N_secondary_amine_5-5-49-47-47": 852,
      "O_ether_5-6-6-6-6": 853,
      "O_ether_5-6-5-6": 854,
      "C_tertiary_carbon_6-8": 855,
      "c_ester_5": 856,
      "Cl_Cl[-1]\n": 857,
      "C_5-3-6": 858,
      "C_tertiary_carbon_6-5-6-6-6": 859,
      "S_sulfhydryl\n": 860,
      "c_6-7-5-6": 861,
      "S_sulfide_4-6": 862,
      "C_6-6-12": 863,
      "c_6-12": 864,
      "c_6-19-6-6-6": 865,
      "C_6-6-15": 866,
      "c_6-6-5-7": 867,
      "C_5-6-18": 868,
      "N_tertiary_amine_7-7": 869,
      "C_5-12": 870,
      "C_6-12-6": 871,
      "o_5-6-5": 872,
      "O_ester_3-5": 873,
      "C_tertiary_carbon_16": 874,
      "O_aldoxime": 875,
      "C_tertiary_carbon_5-16": 876,
      "C_tertiary_carbon_6-6-6-5-6": 877,
      "C_ketone_5-18": 878,
      "N_secondary_amine_5-18": 879,
      "c_5-6-5-5": 880,
      "C_tertiary_carbon_4-5-5-6": 881,
      "O_borono": 882,
      "B_5": 883,
      "C_amide_6-6-7": 884,
      "C_5-7-5-6": 885,
      "C_20": 886,
      "C_6-5-5-7": 887,
      "Br_bromodifluoromethyl": 888,
      "N_imide_4-5": 889,
      "c_5-6-24-6-24": 890,
      "C_6-19-6-19-6": 891,
      "S_sulfonyl_4-7": 892,
      "n_5-6-6-5": 893,
      "C_quaternary_carbon_5-6-5-6": 894,
      "C_tertiary_carbon_5-6-5-6-6": 895,
      "c_4-5-6": 896,
      "C_secondary_ketimine_4": 897,
      "C_tertiary_carbon_5-18": 898,
      "c_6-15": 899,
      "C_ester_3": 900,
      "C_quaternary_carbon_3-4-4": 901,
      "c_6-18": 902,
      "c_6-6-6-16": 903,
      "O_ester_4-5": 904,
      "C_3-4-5": 905,
      "C_4-6-6-8": 906,
      "c_6-13-5-6": 907,
      "C_tertiary_carbon_4-4-4-4-4": 908,
      "C_quaternary_carbon_5-5-6-6-6": 909,
      "O_ether_7-7": 910,
      "N_tertiary_amine_5-4-5": 911,
      "C_secondary_ketimine_5-6-6-6": 912,
      "n_tertiary_amine_5-7-5": 913,
      "n_5-6-6-6-6": 914,
      "C_4-5-4": 915,
      "C_5-11": 916,
      "C_5-17-6": 917,
      "C_ketone_5-6-5": 918,
      "O_ester_5-6-6": 919,
      "C_6-6-5-6-6": 920,
      "C_6-9-5-6": 921,
      "N_secondary_amine_6-6-7": 922,
      "O_ether_6-5-6-6": 923,
      "O_ether_6-6-5-6": 924,
      "c_5-6-5-5-6": 925,
      "c_10-6-5-5-15-6-5-5-5-26": 926,
      "C_tertiary_carbon_5-7-5": 927,
      "C_ketone_5-6-5-6": 928,
      "C_ketone_5-6-6-6-6-6": 929,
      "c_6-5-7-6": 930,
      "O_ether_3-6-6": 931,
      "O_ether_3-5-4": 932,
      "c_5-6-7-6": 933,
      "C_6-6-6-6-6-6": 934,
      "N_amide_7-7": 935,
      "N_secondary_amine_6-6-5-6": 936,
      "C_tertiary_carbon_6-14": 937,
      "c_6-6-7-6": 938,
      "C_5-17-6-17-6": 939,
      "n_amide_6-6-7": 940,
      "C_5-6-6-3-6": 941,
      "c_amide_6-6-7": 942,
      "c_6-8-6": 943,
      "C_4-7-7": 944,
      "C_quaternary_carbon_5-5-5-6": 945,
      "C_tertiary_carbon_5-15": 946,
      "N_secondary_ketimine_5-6-6-6": 947,
      "C_quaternary_carbon_6-4-6": 948,
      "C_ketone_6-5-6-6": 949,
      "C_tertiary_carbon_6-4-6": 950,
      "C_tertiary_carbon_6-19": 951,
      "N_secondary_amine_5-5-5-6": 952,
      "N_secondary_ketimine_7": 953,
      "O_ether_6-4-6": 954,
      "C_5-15": 955,
      "5\n": 956,
      "c_5-18-6": 957,
      "n_tertiary_amine_5-6-7": 958,
      "c_6-7-6-6": 959,
      "n_secondary_amine_6-5-7": 960,
      "c_6-17": 961,
      "c_5-5-18": 962,
      "S_sulfonyl_4-6": 963,
      "C_tertiary_carbon_5-6-24-6-24": 964,
      "C_5-19": 965,
      "C_ketone_5-14": 966,
      "C_4-6-8-6": 967,
      "Cl_trichloromethyl\n": 968,
      "N_5-5": 969,
      "C_5-5-7": 970,
      "C_5-6-6-6-5": 971,
      "C_secondary_ketimine_5-7": 972,
      "c_6-6-6-6-6-6-6": 973,
      "c_ester_6-6-6": 974,
      "C_tertiary_carbon_6-6-6-7-7": 975,
      "N_secondary_ketimine_5-7": 976,
      "C_5-16-5-5-5": 977,
      "S_sulfide_6-5-6": 978,
      "c_5-6-6-5-6-6": 979,
      "C_13": 980,
      "c_imide_5-5-6": 981,
      "s_6-5-6-6": 982,
      "C_ester_4-6-6-8": 983,
      "C_5-6-24-6-24": 984,
      "N_tertiary_amine_6-6-5-6": 985,
      "C_ketone_5-16": 986,
      "c_5-6-5-6-5-6": 987,
      "N_secondary_amine_5-16": 988,
      "c_secondary_ketimine_6-6-6": 989,
      "c_primary_ketimine_6-6": 990,
      "C_amide_6-7-6": 991,
      "n_amide_6-7": 992,
      "C_tertiary_carbon_33": 993,
      "c_amide_6-7": 994,
      "n_amide_6-5-6-6": 995,
      "C_5-6-14": 996,
      "c_6-12-6": 997,
      "S_sulfide_3-6": 998,
      "C_tertiary_carbon_5-5-21": 999,
      "C_quaternary_carbon_4-5-5-5-5": 1000,
      "C_imide_6-6": 1001,
      "c_amide_6-5-6-6": 1002,
      "c_6-20-6-6-20-6": 1003,
      "C_6-17": 1004,
      "s_5-6-7": 1005,
      "O_ester_5-5-5": 1006,
      "c_5-6-5-5-6-6": 1007,
      "c_6-6-5-6-6-6": 1008,
      "C_tertiary_carbon_5-6-6-5-6": 1009,
      "C_6-6-13": 1010,
      "c_6-9": 1011,
      "C_quaternary_carbon_3-4-3": 1012,
      "N_amide_9": 1013,
      "C_3-4-3": 1014,
      "C_ketone_8": 1015,
      "C_6-6-6-5-5-6": 1016,
      "N_tertiary_amine_6-6-7": 1017,
      "C_ketone_5-5-6-6": 1018,
      "c_6-18-6-18": 1019,
      "C_imide_5-6-6": 1020,
      "C_quaternary_carbon_4-5-5-6": 1021,
      "S_sulfide_4-7": 1022,
      "C_ester_5-14": 1023,
      "c_6-6-15": 1024,
      "O_ester_6-6-6": 1025,
      "C_imide_5-5-6": 1026,
      ":": 1027,
      "c_6-11": 1028,
      "[": 1029,
      "]\n": 1030,
      "c_5-19-6": 1031,
      "c_5-20-6-20": 1032,
      "n_amide_6-6-5-6": 1033,
      "C_5-6-8": 1034,
      "C_tertiary_carbon_6-6-5-5-6": 1035,
      "C_ketone_6-6-6-6-6": 1036,
      "C_5-5-5-5-6": 1037,
      "P_phosphoryl": 1038,
      "c_5-6-6-6-5": 1039,
      "c_amide_6-6-5-6": 1040,
      "S_sulfide_5-6-6": 1041,
      "C_tertiary_carbon_3-5-5-5": 1042,
      "C_tertiary_carbon_4-8": 1043,
      "C_tertiary_carbon_5-5-5-5-6": 1044,
      "N_secondary_amine_5-6-5": 1045,
      "N_secondary_amine_6-6-6-6": 1046,
      "O_phosphoryl": 1047,
      "C_ester_4-6": 1048,
      "C_5-5-21": 1049,
      "c_6-14-6": 1050,
      "C_23": 1051,
      "N_imide": 1052,
      "n_secondary_amine_5-6-5-6": 1053,
      "C_ester_5-6-5-6": 1054,
      "c_6-5-8": 1055,
      "c_5-5-5": 1056,
      "C_ketone_6-6-7": 1057,
      "N_tertiary_amine_3-4": 1058,
      "c_6-6-12": 1059,
      "C_quaternary_carbon_6-7-6": 1060,
      "c_6-16-16-6-14-16-6-6-12-6-6-6-16": 1061,
      "c_ketone_6-7-7": 1062,
      "C_6-6-5-5-6": 1063,
      "c_6-6-16-6-16": 1064,
      "C_amide_5-6-6-6": 1065,
      "c_6-6-5-6-7": 1066,
      "C_quaternary_carbon_6-5-6-6-6": 1067,
      "C_tertiary_carbon_4-4-3-4": 1068,
      "C_6-6-16-5-6": 1069,
      "C_ketone_6-14": 1070,
      "C_5-19-6": 1071,
      "n_5-7-5": 1072,
      "c_5-14-6": 1073,
      "C": 1074,
      "C_imide_6-6-6": 1075,
      "O_ether_3-7": 1076,
      "c_primary_ketimine_6-6-6": 1077,
      "C_ester_6-6-5-6-6": 1078,
      "C_5-13": 1079,
      "N_secondary_amine_14": 1080,
      "c_6-5-6-6-5-6-6": 1081,
      "n_6-5-5-6": 1082,
      "C_tertiary_carbon_6-35-35-35-35-35-35-35-6-6-6-35-35-35-35-6-6-35-6-35-35": 1083,
      "Si_Si": 1084,
      "C_quaternary_carbon_3-7": 1085,
      "H": 1086,
      "c_6-6-6-18": 1087,
      "c_6-20-20": 1088,
      "c_5-6-5-6-6-6": 1089,
      "c_5-16": 1090,
      "C_quaternary_carbon_6-5-5-6-6": 1091,
      "N_secondary_amine_4-7": 1092,
      "n_amide_5-6-7": 1093,
      "C_quaternary_carbon_6-5-5-6": 1094,
      "C_6-17-6-17-6": 1095,
      "C_amide_6-7-7": 1096,
      "C_ketone_6-19": 1097,
      "N_secondary_amine_5-14": 1098,
      "c_amide_5-6-7": 1099,
      "C_quaternary_carbon_6-6-7": 1100,
      "c_5-5-6-5-5-5-29": 1101,
      "N_amide_5-7-6": 1102,
      "c_6-18-6-6-18-6": 1103,
      "B_borono": 1104,
      "C_tertiary_carbon_5-6-6-5": 1105,
      "n_tertiary_amine_5-6-6-5": 1106,
      "c_4-6-7": 1107,
      "C_tertiary_carbon_6-5-5-6-6": 1108,
      "c_5-17-6-6-17": 1109,
      "C_ketone_3-6-6-5-6": 1110,
      "c_5-6-6-7": 1111,
      "O_ether_4-5-5-6": 1112,
      "C_tertiary_carbon_4-5-6-5": 1113,
      "S_sulfide_6-6-7": 1114,
      "O_phosphono\n": 1115,
      "C_6-14-6": 1116,
      "C_ketone_5-7-6": 1117,
      "c_ester_6-7": 1118,
      "C_5-6-6-7": 1119,
      "S_sulfide_3-6-5": 1120,
      "C_6-6-21": 1121,
      "C_6-8-6": 1122,
      "c_7-6-7": 1123,
      "N_secondary_amine_3-4": 1124,
      "N_imide_5-6-5": 1125,
      "C_secondary_ketimine_6-6-6": 1126,
      "c_5-5-6-5-6": 1127,
      "N_4_ammonium_ion_6": 1128,
      "C_ester_6-5-6": 1129,
      "C_primary_aldimine": 1130,
      "C_tertiary_carbon_4-6-6-8": 1131,
      "n_tertiary_amine_5-7-6": 1132,
      "N_nitroso": 1133,
      "C_quaternary_carbon_4-6-6-8": 1134,
      "N_imide_6-5-6": 1135,
      "C_tertiary_carbon_5-6-6-6-6-6-6": 1136,
      "C_ester_4-6-8-6": 1137,
      "C_quaternary_carbon_5-6-6-6-6-6-6": 1138,
      "c_5-20-20-6-20-6-20": 1139,
      "C_quaternary_carbon_3-6-5": 1140,
      "o_6-6-6-6": 1141,
      "C_5-10": 1142,
      "c_6-21-21": 1143,
      "C_secondary_ketimine_6-6-7": 1144,
      "C_tertiary_carbon_4-6-8-6": 1145,
      "C_tertiary_carbon_4-5-4": 1146,
      "N_secondary_amine_5-7-6": 1147,
      "B_5-6": 1148,
      "C_tertiary_carbon_5-21": 1149,
      "c_5-20-6-6-20-6": 1150,
      "C_tertiary_carbon_4-4-4-5-5": 1151,
      "c_6-18-6-6-6-6-18-6": 1152,
      "C_ketone_14": 1153,
      "C_tertiary_carbon_6-6-6-5-5-6": 1154,
      "C_tertiary_carbon_5-19": 1155,
      "C_tertiary_carbon_4-4-5-5-5": 1156,
      "c_5-5-5-5-6-6": 1157,
      "C_6-5-6-5-6": 1158,
      "O_ether_4-6-6": 1159,
      "N_amide_6-6-6-6": 1160,
      "C_tertiary_carbon_3-5-3": 1161,
      "C_6-5-6-7": 1162,
      "c_6-16-6-16": 1163,
      "N_secondary_amine_6-14": 1164,
      "o_5-5-6": 1165,
      "C_6-6-6-7-7": 1166,
      "C_ester_16": 1167,
      "0": 1168,
      "C_ester_15": 1169,
      "C_5-18-6": 1170,
      "N_secondary_ketimine_6-6-7": 1171,
      "O_ether_5-6-7": 1172,
      "C_quaternary_carbon_6-6-7-6-7": 1173,
      "C_ketone_5-21": 1174,
      "N_secondary_amine_5-21": 1175,
      "C_5-5-49-47-47": 1176,
      "N_5": 1177,
      "N_tertiary_amine_4-5-5-6": 1178,
      "c_6-13": 1179,
      "N_amide_4-6-6": 1180,
      "Cl_Cl[-1]": 1181,
      "c_5-6-14": 1182,
      "c_6-6-5-16": 1183,
      "c_thioketone_5-6-6": 1184,
      "C_6-6-6-16": 1185,
      "C_tertiary_carbon_35": 1186,
      "c_6-12-16-16-6-6-16-6-16-6": 1187,
      "c_6-16-16-6-12-16-6-6-16-6": 1188,
      "C_6-6-8": 1189,
      "s_6-5-7": 1190,
      "C_5-5-18": 1191,
      "C_6-13-6": 1192,
      "C_6-10": 1193,
      "O_ether_6-7-7": 1194,
      "C_tertiary_carbon_6-6-21": 1195,
      "C_tertiary_carbon_3-5-4-5": 1196,
      "l": 1197,
      "Si_silyl_ether": 1198,
      "C_quaternary_carbon_6-6-6-5-6": 1199,
      "C_6-20-6-6-6-20": 1200,
      "N_tertiary_amine_3-6-6": 1201,
      "C_ketone_35": 1202,
      "N_secondary_amine_35": 1203,
      "c_5-14": 1204,
      "O_silyl_ether": 1205,
      "S_sulfonyl_6-5-6": 1206,
      "S_disulfide_20": 1207,
      "O_ether_6-14": 1208,
      "n_5-14": 1209,
      "C_tertiary_carbon_19": 1210,
      "C_5-6-5-5": 1211,
      "C_amide_5-6-5": 1212,
      "n_secondary_amine_5-6-6-6": 1213,
      "C_6-20-20": 1214,
      "C_tertiary_carbon_6-5-5-6": 1215,
      "C_4-6-7": 1216,
      "C_ketone_5-19": 1217,
      "C_6-5-8": 1218,
      "O_ether_4-4": 1219,
      "N_secondary_amine_5-19": 1220,
      "C_quaternary_carbon_5-6-6-3-6": 1221,
      "C_6-21-21": 1222,
      "C_6-5-15": 1223,
      "N_secondary_amine_6-15": 1224,
      "S_sulfide_6-7-6": 1225,
      "O_peroxy_6-6-7-6-7": 1226,
      "C_6-16": 1227,
      "C_ketone_16": 1228,
      "N_imide_5-6-6-6": 1229,
      "N_imide_5-6-5-6": 1230,
      "N_tertiary_amine_9": 1231,
      "c_secondary_ketimine_5-6-6": 1232,
      "N_amide_5-5-6-5": 1233,
      "o_6-5-6-6": 1234,
      "S_sulfide_3-5-6": 1235,
      "N_secondary_amine_6-18": 1236,
      "N_imide_5-5-5-6": 1237,
      "N_amide_5-14": 1238,
      "c_ketone_6-7": 1239,
      "C_ketone_6-15": 1240,
      "C_amide_33": 1241,
      "N_amide_33": 1242,
      "C_quaternary_carbon_4-6-8-6": 1243,
      "C_5-21": 1244,
      "N_secondary_amine_19": 1245,
      "C_ketone_5-5-5-5-6": 1246,
      "C_tertiary_carbon_6-6-6-6-6-6": 1247,
      "C_imide_4-5": 1248,
      "N_imide_5-6-6-6-6-6": 1249,
      "c_6-6-18-6-6-18-6-6": 1250,
      "c_6-3-6": 1251,
      "C_ketone_19": 1252,
      "C_3-15-5": 1253,
      "C_3-5-5-5": 1254,
      "C_ester_14": 1255,
      "O_nitroso": 1256,
      "C_3-5-3": 1257,
      "C_4-3-5": 1258,
      "N_tertiary_amine_6-8": 1259,
      "n_amide_6-6-6-6": 1260,
      "c_amide_6-6-6-6": 1261,
      "C_tertiary_carbon_5-6-6-3-6": 1262,
      "N_secondary_amine_6-19": 1263,
      "c_6-5-16-5-6-5-6-5-6": 1264,
      "c_6-15-6": 1265,
      "C_amidine": 1266,
      "c_6-19": 1267,
      "C_quaternary_carbon_5-6-5-6-6": 1268,
      "C_ketone_5-5-18": 1269,
      "N_secondary_amine_6-17": 1270,
      "C_secondary_ketimine_6-7-6": 1271,
      "C_tertiary_carbon_6-16-6-6": 1272,
      "C_6-22": 1273,
      "N_primary_aldimine": 1274,
      "n_amide_5-6-6-6": 1275,
      "C_5-6-21": 1276,
      "O_ether_6-5-6-6-6": 1277,
      "c_6-20-6-20": 1278,
      "c_5-18": 1279,
      "C_ketone_6-17": 1280,
      "C_ester_5-6-6-6-6": 1281,
      "N_secondary_ketimine_6-7-6": 1282,
      "s_6-6": 1283,
      "C_tertiary_carbon_6-40-40-40-40-40-40-40-40-40-40-40-6-6-6-6-40-40-40-40-40-6-6-40-40-40-6-40-40-40": 1284,
      "c_6-23-6-23": 1285,
      "C_ketone_5-5-21": 1286,
      "N_secondary_amine_5-5-21": 1287,
      "C_tertiary_carbon_6-15": 1288,
      "C_secondary_ketimine_5-5-6": 1289,
      "C_6-6-6-6-5-6": 1290,
      "N_tertiary_amine_6-7-6": 1291,
      "N_nitrate": 1292,
      "c_amide_5-6-6-6": 1293,
      "C_ester_6-6-6-6": 1294,
      "n_6-6-5-6-6": 1295,
      "C_3-5-6-5": 1296,
      "N_tertiary_amine_5-5-6-6": 1297,
      "c_ester_5-6-6": 1298,
      "C_tertiary_carbon_4-7-7": 1299,
      "N_secondary_amine_31": 1300,
      "C_ketone_31": 1301,
      "S_disulfide_5": 1302,
      "C_amide_4-4": 1303,
      "c_5-5-5-6-6-6": 1304,
      "o_5-6-6-6": 1305,
      "Cl_dichloromethyl": 1306,
      "N_secondary_amine_5-5-18": 1307,
      "N_secondary_amine_16": 1308,
      "C_3-5-6-6-6": 1309,
      "C_secondary_ketimine_6-6-5-6": 1310,
      "n_amide_5-6-5-6": 1311,
      "C_6-20-6-20": 1312,
      "C_tertiary_carbon_5-13": 1313,
      "C_ketone_6-18": 1314,
      "C_quaternary_carbon_4-5-6-5": 1315,
      "N_imide_5-5-6-6": 1316,
      "n_6-8": 1317,
      "n_tertiary_amine_5-8": 1318,
      "O_sulfonic_acid\n": 1319,
      "n_secondary_amine_6-7": 1320,
      "C_quaternary_carbon_15": 1321,
      "C_6-5-6-6-3-6": 1322,
      "C_6-16-6-6-6": 1323,
      "c_6-20-20-6-6-20-20": 1324,
      "N_secondary_ketimine_5-5-6": 1325,
      "N_imide_6-6-6-6": 1326,
      "C_ester_6-6-6-6-6": 1327,
      "O_ether_5-6-6-5": 1328,
      "P_P[1]": 1329,
      "N_amide_6-5-6-6": 1330,
      "c_6-16-5-6": 1331,
      "o_6-6-5-6": 1332,
      "C_6-9": 1333,
      "C_imide_5-7": 1334,
      "N_imide_3-5": 1335,
      "C_tertiary_carbon_3-6-5-6-6": 1336,
      "N_secondary_amine_6-18-6-6": 1337,
      "c_6-20-6": 1338,
      "N_secondary_amine_9": 1339,
      "S_5-6": 1340,
      "C_5-13-6": 1341,
      "N_secondary_ketimine_6-6-6": 1342,
      "S_sulfide_5-6-6-6": 1343,
      "C_amide_3-5": 1344,
      "C_secondary_ketimine_4-5": 1345,
      "C_4-4-5-5": 1346,
      "C_tertiary_carbon_5-6-6-6-5": 1347,
      "c_6-13-6": 1348,
      "C_6-20": 1349,
      "c_5-19-6-19-6": 1350,
      "C_quaternary_carbon_14": 1351,
      "C_tertiary_carbon_5-5-5-6-5": 1352,
      "C_secondary_aldimine_5-6-6": 1353,
      "N_secondary_aldimine_5-6-6": 1354,
      "C_tertiary_carbon_6-6-5-6-5-6": 1355,
      "N_hydrazone": 1356,
      "C_quaternary_carbon_6-5-5-6-6-6": 1357,
      "N_secondary_amine_5-17-6-17-6": 1358,
      "C_ketone_5-15": 1359,
      "C_ketone_5-6-5-6-6": 1360,
      "O_ether_5-17-6-17-6": 1361,
      "C_ketone_5-17-6-17-6": 1362,
      "c_6-23-6": 1363,
      "C_5-3-5": 1364,
      "C_6-6-6-15": 1365,
      "C_ester_6-7": 1366,
      "C_ketone_3-4": 1367,
      "O_ether_6-18-6-6": 1368,
      "C_6-36": 1369,
      "C_tertiary_carbon_31": 1370,
      "N_secondary_amine_5-15": 1371,
      "C_tertiary_carbon_6-5-6-6-3-6": 1372,
      "N_secondary_amine_6-5-6-6": 1373,
      "O_ether_5-7-6": 1374,
      "c_6-6-13": 1375,
      "C_5-3-15": 1376,
      "C_3-6-6-6-5": 1377,
      "C_tertiary_carbon_5-17-6-17-6": 1378,
      "N_tertiary_amine_4-6-6": 1379,
      "C_quaternary_carbon_6-6-5-6-6": 1380,
      "C_tertiary_carbon_28": 1381,
      "C_amide_6-8": 1382,
      "C_tertiary_carbon_5-3-5": 1383,
      "c_6-6-6-15": 1384,
      "C_tertiary_carbon_5-5-7": 1385,
      "c_6-6-21-21-6-21-6-21": 1386,
      "C_ester_6-14": 1387,
      "N_secondary_amine_5-6-18": 1388,
      "c_6-6-6-6-7": 1389,
      "N_imide_3-6-6-5-6": 1390,
      "C_quaternary_carbon_5-5-6-6": 1391,
      "c_6-25-6-25": 1392,
      "C_6-6-18-6-18-6": 1393,
      "n_secondary_amine_5-16-5-5-5": 1394,
      "n_imide_6-6-6": 1395,
      "C_tertiary_carbon_6-6-12": 1396,
      "C_4-5-5-5": 1397,
      "C_5-6-7-6": 1398,
      "c_5-6-21": 1399,
      "c_5-6-6-5-6-5": 1400,
      "N_secondary_amine_6-21-21": 1401,
      "C_secondary_aldimine_5-6": 1402,
      "N_secondary_aldimine_5-6": 1403,
      "C_ketone_6-21-21": 1404,
      "C_tertiary_carbon_6-6-16-5-6": 1405,
      "N_tertiary_amine_5-7-6": 1406,
      "N_tertiary_amine_12": 1407,
      "C_tertiary_carbon_4-5-5-5": 1408,
      "c_ketone_6-6-6-6": 1409,
      "c_5-16-5-5-5-5": 1410,
      "c_6-5-5-5-5-6": 1411,
      "C_6-5-17": 1412,
      "C_5-20-6-20": 1413,
      "C_haloformyl": 1414,
      "C_6-6-7-6-6": 1415,
      "Br_bromodifluoromethyl\n": 1416,
      "c_4-5": 1417,
      "n_5-16-5-5-5": 1418,
      "C_ketone_11": 1419,
      "N_tertiary_amine_6-5-5-6-6": 1420,
      "C_quaternary_carbon_5-3-6": 1421,
      "C_tertiary_carbon_5-6-8": 1422,
      "C_ketone_5-5-5-5": 1423,
      "c_amide_5-6-5-6": 1424,
      "O_ether_6-16-6-6": 1425,
      "C_primary_ketimine_6": 1426,
      "O_haloformyl": 1427,
      "C_tertiary_carbon_6-18-6-6": 1428,
      "C_tertiary_carbon_6-17": 1429,
      "C_tertiary_carbon_5-8": 1430,
      "C_6-6-6-7": 1431,
      "C_ketone_6-18-6-6": 1432,
      "O_ether_4-5-6-5": 1433,
      "S_sulfonyl_5-5-5": 1434,
      "C_ester_5-7-5": 1435,
      "C_6-6-5-6-6-6": 1436,
      "N_secondary_ketimine_6-6-5-6": 1437,
      "C_amide_5-7-6": 1438,
      "N_secondary_amine_5-6-5-6": 1439,
      "C_21": 1440,
      "c_5-6-8-6": 1441,
      "c_5-21": 1442,
      "c_6-16-16-6-6-12-16-6-6-16-14-6-6": 1443,
      "N_secondary_amine_11": 1444,
      "C_ketone_5-6-18": 1445,
      "C_amide_6-5-7": 1446,
      "C_5-50-37-58": 1447,
      "N_secondary_amine_28": 1448,
      "C_ketone_28": 1449,
      "C_ketone_5-6-6-6-6": 1450,
      "N_amide_3-7": 1451,
      "O_6-6-7-6-7": 1452,
      "C_quaternary_carbon_5-7-6": 1453,
      "N_secondary_amine_13": 1454,
      "C_imide_5-5-5-6": 1455,
      "C_tertiary_carbon_5-5-18": 1456,
      "n_tertiary_amine_5-5-7": 1457,
      "C_6-6-6-6-6-6-6": 1458,
      "c_5-7-6-5": 1459,
      "N_secondary_amine_33": 1460,
      "C_tertiary_carbon_6-12-16-16-6-6-6-16-6-16": 1461,
      "C_6-6-16-6-16": 1462,
      "C_tertiary_carbon_3-3-5": 1463,
      "C_ketone_33": 1464,
      "C_6-6-7-6": 1465,
      "N_tertiary_amine_3-4-4": 1466,
      "N_tertiary_amine_4-8": 1467,
      "N_4_ammonium_ion_6-6-6": 1468,
      "C_ketone_21": 1469,
      "N_amide_5-4-5": 1470,
      "N_secondary_amine_21": 1471,
      "N_secondary_amine_4-4": 1472,
      "O_ether_6-6-6-6-6": 1473,
      "C_ester_5-7": 1474,
      "c_3-5-5": 1475,
      "O_carboxylate\n": 1476,
      "O_ether_3-4-4": 1477,
      "C_quaternary_carbon_5-6-6-5-6": 1478,
      "n_4-5-6": 1479,
      "C_tertiary_carbon_21": 1480,
      "O_ester_5-14": 1481,
      "C_tertiary_carbon_5-5-5-5-5-5": 1482,
      "c_6-21-21-6-6-6-21": 1483,
      "N_amide_5-7-5": 1484,
      "C_3-10-5": 1485,
      "C_tertiary_carbon_6-18": 1486,
      "C_tertiary_carbon_3-4-5-3-5": 1487,
      "C_17": 1488,
      "C_tertiary_carbon_12": 1489,
      "Se_Se": 1490,
      "c_6-16": 1491,
      "o_5-6-5-6": 1492,
      "C_quaternary_carbon_5-6-6-5": 1493,
      "C_ketone_49": 1494,
      "N_secondary_amine_49": 1495,
      "C_tertiary_carbon_13": 1496,
      "C_6-6-6-18": 1497,
      "C_6-6-29": 1498,
      "O_ether_5-5-6-6": 1499,
      "C_tertiary_carbon_49": 1500,
      "c_5-7-7-6": 1501,
      "C_tertiary_carbon_3-4-6": 1502,
      "C_tertiary_carbon_5-20-6-20": 1503,
      "C_quaternary_carbon_6-6-5-5-6": 1504,
      "C_6-18-6-6-6-18": 1505,
      "C_ketone_20-20-22-22": 1506,
      "N_secondary_amine_20-20-22-22": 1507,
      "C_quaternary_carbon_4-4-4-4-4": 1508,
      "C_tertiary_carbon_4-4-4-4": 1509,
      "N_amide_5-6-17": 1510,
      "C_3-4-6": 1511,
      "C_24": 1512,
      "n_amide_6-6-5-6-6": 1513,
      "c_ketone_6-6-5-6": 1514,
      "c_6-6-7-6-6": 1515,
      "c_3-20-6-20": 1516,
      "C_tertiary_carbon_26": 1517,
      "Cl_haloformyl": 1518,
      "N_secondary_amine_6-5-7": 1519,
      "C_tertiary_carbon_5-32": 1520,
      "C_6-13-5-6-8": 1521,
      "c_amide_6-6-5-6-6": 1522,
      "S_sulfide_4-5": 1523,
      "C_5-15-6": 1524,
      "C_ketone_6-5-5-6": 1525,
      "C_thioketone_6-6-6": 1526,
      "c_6-7-6-5-5-6-5-6": 1527,
      "O_ether_6-15": 1528,
      "c_6-20-20-6-20-6-20": 1529,
      "c_5-6-5-5-5-6": 1530,
      "N_imide_5-5-5-5": 1531,
      "C_6-6-5-7": 1532,
      "n_secondary_amine_6-5-6-6": 1533,
      "n_6-6-6-6-6": 1534,
      "C_ester_4-4": 1535,
      "O_5-6-6-6-6-6": 1536,
      "O_ester_5-6-5-6": 1537,
      "N_tertiary_amine_4-5-6-5": 1538,
      "O_ether_4-4-4": 1539,
      "C_ketone_6-5-6-6-6": 1540,
      "c_6-6-19-6-19-6": 1541,
      "C_6-5-14": 1542,
      "N_N[-1]": 1543,
      "n_amide_6-5-7": 1544,
      "c_amide_6-5-7": 1545,
      "C_ketone_5-6-24-6-24": 1546,
      "c_5-5-19": 1547,
      "c_6-5-6-6-6-6": 1548,
      "N_secondary_amine_6-20-20": 1549,
      "P_6": 1550,
      "C_tertiary_carbon_4-6-5-6": 1551,
      "C_6-5-7-6": 1552,
      "N_amide_6-16-6-6": 1553,
      "C_6-19-6-6-6": 1554,
      "c_6-16-16-6-16-6-12-6-16-6": 1555,
      "C_5-20-6-6-6-20": 1556,
      "C_tertiary_carbon_5-7-5-6": 1557,
      "C_5-6-5-5-6": 1558,
      "c_6-14-5-6": 1559,
      "N_amide_6-14": 1560,
      "N_secondary_amine_6-16-6-6": 1561,
      "C_quaternary_carbon_3-4-5": 1562,
      "n_imide_5": 1563,
      "C_3-14-5": 1564,
      "N_tertiary_amine_6-6-6-5-6": 1565,
      "O_ester_5-6-6-6": 1566,
      "C_ketone_6-20-20": 1567,
      "c_5-6-5-6-5": 1568,
      "C_quaternary_carbon_6-6-6-6-6-6": 1569,
      "c_ketone_5-7": 1570,
      "C_ketone_3-6": 1571,
      "O_ether_6-6-6-5-6": 1572,
      "C_5-7-6-6": 1573,
      "C_ketone_6-16-6-6": 1574,
      "N_tertiary_amine_6-6-7-7": 1575,
      "C_tertiary_carbon_20-20-22-22": 1576,
      "C_ketone_5-8": 1577,
      "c_5-6-5-7": 1578,
      "C_6-15-6": 1579,
      "c_6-8-5-6": 1580,
      "C_quaternary_carbon_3-5-5": 1581,
      "C_tertiary_carbon_3-4-4-3-4": 1582,
      "C_tertiary_carbon_4-5-5-5-5-5-5": 1583,
      "C_tertiary_carbon_6-20-20": 1584,
      "c_5-13-6": 1585,
      "O_ester_6-6-5-6-6": 1586,
      "c_6-6-6-5-6-6": 1587,
      "n_5-18": 1588,
      "C_19": 1589,
      "n_5-6-5-5": 1590,
      "C_5-20-20-6-20-6-20": 1591,
      "O_ether_6-19-6-19-6": 1592,
      "c_6-12-16-16-6-6-16-6-14-6-6-6-16": 1593,
      "C_tertiary_carbon_4-4-4-4-4-4": 1594,
      "N_secondary_ketimine_5-7-6": 1595,
      "C_tertiary_carbon_11": 1596,
      "C_ester_7": 1597,
      "c_5-5-6-5": 1598,
      "c_5-6-8": 1599,
      "n_5-5-18": 1600,
      "C_5-3-6-6-6": 1601,
      "c_5-5-21": 1602,
      "N_secondary_amine_5-6-17": 1603,
      "C_secondary_ketimine_5-7-6": 1604,
      "C_tertiary_carbon_5-14-6": 1605,
      "C_secondary_aldimine_6-6": 1606,
      "N_secondary_aldimine_6-6": 1607,
      "O_ether_5-5-6-6-6": 1608,
      "C_tertiary_carbon_5-23": 1609,
      "c_5-6-6-6-5-5": 1610,
      "c_5-6-6-6-5-6": 1611,
      "C_imide_5-6-6-6": 1612,
      "C_tertiary_carbon_6-19-6-19-6": 1613,
      "C_quaternary_carbon_6-6-6-7-7": 1614,
      "C_tertiary_carbon_3-6-6-6-5": 1615,
      "c_4-6-6-6": 1616,
      "N_secondary_amine_26": 1617,
      "c_6-6-6-17": 1618,
      "C_tertiary_carbon_5-6-5-5-5": 1619,
      "C_6-6-16-6": 1620,
      "N_amide_3-6-5": 1621,
      "C_4-4-4-5-5": 1622,
      "C_ketone_26": 1623,
      "C_ketone_5-6-17": 1624,
      "C_quaternary_carbon_5-6-6-6-5": 1625,
      "C_tertiary_carbon_5-11": 1626,
      "O_peroxy_6-6-6-7-7": 1627,
      "c_5-6-7-6-6": 1628,
      "C_ketone_13": 1629,
      "C_tertiary_carbon_6-21-21": 1630,
      "C_5-6-6-5-6-6": 1631,
      "C_6-18-6": 1632,
      "c_6-5-6-5-6-6": 1633,
      "C_isothiocyanate": 1634,
      "N_isothiocyanate": 1635,
      "c_5-18-5": 1636,
      "c_ketone_7": 1637,
      "C_ketone_5-20-6-20": 1638,
      "N_secondary_amine_5-20-6-20": 1639,
      "C_amide_6-6-6-6": 1640,
      "C_quaternary_carbon_5-6-8": 1641,
      "N_tertiary_amine_5-5-5-6": 1642,
      "C_quaternary_carbon_4-5-6": 1643,
      "C_tertiary_carbon_17": 1644,
      "s_5-6-6-6": 1645,
      "C_5-23": 1646,
      "C_ester_5-5-6-6": 1647,
      "Cl_difluorochloromethyl\n": 1648,
      "C_ketone_6-6-5-5-6": 1649,
      "c_6-18-18-6-6-18-6-18": 1650,
